app/controllers/groups_controller.rb

  def show
    render json: Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @group = current_user.groups.build(group_params)

    if @group.save
---
INSERT INTO "groups" ("Name", "Type", "Intro", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Name", "Roomies"], ["Type", "RoomMates"], ["Intro", ""], ["created_at", "2019-07-22 16:17:49.992986"], ["updated_at", "2019-07-22 16:17:49.992986"]]

  def update
    if @group.update(group_params)
---
UPDATE "groups" SET "Name" = $1, "Type" = $2, "Intro" = $3, "updated_at" = $4 WHERE "groups"."id" = $5  [["Name", "Beer Buds"], ["Type", ""], ["Intro", ""], ["updated_at", "2019-07-22 17:15:07.754477"], ["id", 1]]

  def destroy
    Group.find(params[:id]).destroy
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 33]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]

  def set_group
    @group = current_user.groups.find(params[:id])
---
SELECT  "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = $1 AND "groups"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 50], ["LIMIT", 1]]