app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = $1  [["user_id", 2]]
---
  def index
    @memberships = current_user.memberships.all

INSERT INTO "memberships" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["group_id", 2], ["created_at", "2019-07-23 15:18:15.619980"], ["updated_at", "2019-07-23 15:18:15.619980"]]
---
  def create
    @membership = current_user.memberships.build(membership_params)
    # @membership = Membership.build(membership_params)

    if @membership.save

DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 43]]
---
  def destroy
    @membership.destroy

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."user_id" = $1 AND "memberships"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 43], ["LIMIT", 1]]
---
  def set_membership
    @membership = current_user.memberships.find(params[:id])