app/controllers/users_controller.rb

  def update
    if User.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "group_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-07-23 14:07:50.838872"], ["group_id", 1], ["id", 1]]

  def signup
    user = User.create(user_creds)
---
INSERT INTO "users" ("email", "token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def changepw
    # if the the old password authenticates,
    # the new one is not blank,
    # and the model saves
    # then 204
    # else 400
    if current_user.authenticate(pw_creds[:old]) &&
       !(current_user.password = pw_creds[:new]).blank? &&
       current_user.save
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-07-24 18:53:13.453948"], ["password_digest", "$2a$10$wsqd50Babj3uG81ym4Hyq.CS/sAjSnTYPC15hZ3jZVhtLaCN.4kI."], ["id", 2]]